# ── Taps ───────────────────────────────────────────────────
tap "felixkratz/formulae"      # sketchybar, borders
tap "koekeishiya/formulae"     # yabai, skhd
tap "leoafarias/fvm"           # flutter version manager

# ── Window Management ──────────────────────────────────────
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"
brew "felixkratz/formulae/sketchybar"
brew "felixkratz/formulae/borders"

# ── Shell & Prompt ─────────────────────────────────────────
brew "starship"
brew "zoxide"
brew "fzf"
brew "stow"                    # dotfiles symlink manager
brew "mise"                    # tool version manager (node, bun, python, etc.)

# ── Modern CLI ─────────────────────────────────────────────
brew "bat"                     # cat
brew "eza"                     # ls
brew "ripgrep"                 # grep
brew "fd"                      # find
brew "jq"                      # json
brew "git-delta"               # diff
brew "lazygit"                 # git tui
brew "btop"                    # system monitor
brew "fastfetch"               # system info
brew "yazi"                    # file manager
brew "tailspin"                # log viewer

# ── Editors ────────────────────────────────────────────────
brew "neovim"

# ── Development ────────────────────────────────────────────
brew "gh"                      # github cli
brew "go"
brew "rust"
brew "pipx"
brew "leoafarias/fvm/fvm"      # flutter version manager
brew "cocoapods"

# ── DevOps ─────────────────────────────────────────────────
brew "docker-compose"
brew "doctl"                   # digitalocean
brew "flyctl"                  # fly.io
brew "doppler"                 # secrets

# ── Utilities ──────────────────────────────────────────────
brew "imagemagick"
brew "ffmpegthumbnailer"
brew "nmap"
brew "bitwarden-cli"

# ── Claude Code Helpers ────────────────────────────────────
brew "tree"                    # directory structure (used by Claude for project overview)
brew "ast-grep"                # AST-aware code search via `sg` command
brew "difftastic"              # structural diffs (understands syntax, not just text)
brew "scc"                     # fast code statistics (lines, languages, complexity)
brew "sd"                      # simpler sed for quick text replacements
brew "yq"                      # jq but for YAML/TOML files
brew "nowplaying-cli"          # media controls for sketchybar

# ── Casks ──────────────────────────────────────────────────
cask "ghostty"
cask "docker-desktop"
cask "dbeaver-community"
cask "mitmproxy"
cask "sf-symbols"

# ── Fonts ──────────────────────────────────────────────────
cask "font-atkinson-hyperlegible-mono"
cask "font-hack-nerd-font"
cask "font-inter"
cask "font-monaspace"
cask "font-monaspice-nerd-font"
cask "font-sf-pro"
cask "font-symbols-only-nerd-font"

# ── QuickLook Plugins ─────────────────────────────────────
cask "qlcolorcode"
cask "qlstephen"
cask "syntax-highlight"
